spec/fixtures/stripe_events/invoice_payment_failed.json

{
  "id": "evt_18D46XAcWgwn5pBtTNAPj1zx",
  "object": "event",
  "api_version": "2015-04-07",
  "created": 1463714113,
  "data": {
    "object": {
      "id": "in_18D45lAcWgwn5pBtU5JaLk9k",
      "object": "invoice",
      "amount_due": 500000,
      "application_fee": null,
      "attempt_count": 1,
      "attempted": true,
      "charge": "ch_18D46XAcWgwn5pBtJTzzp1Py",
      "closed": false,
      "currency": "usd",
      "customer": "cus_8U1TcYRfvl8VqP",
      "date": 1463714065,
      "description": null,
      "discount": null,
      "ending_balance": 0,
      "forgiven": false,
      "lines": {
        "object": "list",
        "data": [
          {
            "id": "ii_18D3YMAcWgwn5pBtqEeM02bs",
            "object": "line_item",
            "amount": 500000,
            "currency": "usd",
            "description": null,
            "discountable": true,
            "livemode": false,
            "metadata": {},
            "period": {
              "start": 1463711994,
              "end": 1463711994
            },
            "plan": null,
            "proration": false,
            "quantity": null,
            "subscription": "sub_8U1VI45WcTmBFt",
            "type": "invoiceitem"
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/invoices/in_18D45lAcWgwn5pBtU5JaLk9k/lines"
      },
      "livemode": false,
      "metadata": {},
      "next_payment_attempt": 1463973313,
      "paid": false,
      "period_end": 1463714065,
      "period_start": 1463711601,
      "receipt_number": null,
      "starting_balance": 0,
      "statement_descriptor": null,
      "subscription": null,
      "subtotal": 500000,
      "tax": null,
      "tax_percent": null,
      "total": 500000,
      "webhooks_delivered_at": 1463714102,
      "payment": "ch_18D46XAcWgwn5pBtJTzzp1Py"
    }
  },
  "livemode": false,
  "pending_webhooks": 0,
  "request": "req_8U2AhsQOCjAGy4",
  "type": "invoice.payment_failed"
}
